# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# Напишите функцию
# - Аргументы: список чисел и границы диапазона
# - Возвращает: список индексов элементов (смотри условие)

# Примеры/Тесты:
# lst1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# <function_name>(lst1, 2, 10) -> [1, 3, 7, 9, 10, 13, 14, 19]
# <function_name>(lst1, 2, 9) -> [1, 3, 7, 10, 13, 19]
# <function_name>(lst1, 0, 6) -> [2, 3, 6, 7, 10, 11, 16]

def find_indices(lst, min_value, max_value):
    indices = []
    for index, value in enumerate(lst):
        if min_value <= value <= max_value:
            indices.append(index)
    return indices

lst1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]


print(find_indices(lst1, 2, 10))  # Output: [1, 3, 7, 9, 10, 13, 14, 19]
print(find_indices(lst1, 2, 9))  # Output: [1, 3, 7, 10, 13, 19]
print(find_indices(lst1, 0, 6))  # Output: [2, 3, 6, 7, 10, 11, 16]
